import z from "zod";

export const edit_form_schema = z.object({
  first_name: z
    .string()
    .min(2, "نام باید حداقل ۲ کاراکتر باشد.")
    .max(50, "نام نمی‌تواند بیشتر از ۵۰ کاراکتر باشد."),
  last_name: z
    .string()
    .min(2, "نام خانوادگی باید حداقل ۲ کاراکتر باشد.")
    .max(50, "نام خانوادگی نمی‌تواند بیشتر از ۵۰ کاراکتر باشد."),
  phone: z
    .string()
    .regex(/^09\d{9}$/, "شماره موبایل باید ۱۱ رقم و با ۰۹ شروع شود."),
  email: z
    .email({ message: "ایمیل معتبر نیست." })
    .max(100, "ایمیل نمی‌تواند بیشتر از ۱۰۰ کاراکتر باشد."),
  address: z
    .string()
    .min(10, "آدرس باید حداقل ۱۰ کاراکتر باشد.")
    .max(500, "آدرس نمی‌تواند بیشتر از ۵۰۰ کاراکتر باشد."),
});
