import { toPersianDigits } from "@/utils/to-persian-digits";

export default function OurStory() {
  return (
    <div className="">
      <h6 className="text-lg text-muted-foreground font-semibold">داستان ما</h6>
      <h1 className="text-3xl my-4 font-bold">
        ساخته شده بر اعتماد، یک سبد خرید در یک زمان
      </h1>
      <p className="text- text-muted-foreground">
        همه چیز از یک مغازه کوچک {toPersianDigits("25 سال پیش")} شروع شد، اما
        ریشه این کسب‌وکار خیلی قدیمی‌تر از این حرف‌هاست. پدر ما سال‌ها همین کار
        را می‌کرد
        <br /> با دستان پر از تجربه و قلبی پر از صفا. حالا ما با بیش از ۲۵ سال
        تجربه خانوادگی، قدم در راهی گذاشته‌ایم که او برای ما هموار کرد. ما از
        همان اول روی چیزهایی که بلد بودیم تمرکز کردیم: مواد خوراکی
        بسته‌بندی‌شده، نوشیدنی‌ها، لبنیات، محصولات بهداشتی شخصی و ملزومات خانه.
        فقط همان چیزهایی که هر هفته نیاز دارید، با کیفیت ثابت و قیمت منصفانه. و
        حالا، بعد از یک‌چهارم قرن، تصمیم گرفتیم قدم بعدی را برداریم. برای اینکه
        همیشه کنارتان باشیم <br /> حتی وقتی وقت یا حوصله بیرون رفتن ندارید —
        فروشگاه خود را به دنیای آنلاین آوردیم
      </p>
    </div>
  );
}
